Revit 2027 API
DimensionSegment.Origin Property
 The segment origin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Origin { get; }
Public ReadOnly Property Origin As XYZ
	Get
public:
property XYZ^ Origin {
	XYZ^ get ();
}
member Origin : XYZ with get
Property Value
XYZ
Remarks
The origin will be the midpoint of the line that makes up the segment.
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace